Repository: sheilagomes/wp-trad
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: Make sure the version string is correctly escaped for use in generator tags.
pt_br: Verificação e escape da string que contém a versão do WordPress, usada nas tags "generator".

source: Make sure to update these for an improved block editing experience.
pt_br: Tenha certeza de atualizá-los para uma melhor experiência na edição com blocos.

source: Make the Image Link URL field readonly.
pt_br: Alteração no campo de URL do link da imagem para somente leitura.

source: Make your WordPress pretty
pt_br: Faça seu WordPress ficar lindo

source: Making sure you have the latest version of PHP ensures your website is as fast, and secure as possible.
pt_br: Tendo certeza de que você está usando a versão mais recente do PHP, você assegura que o seu site está tão rápido e seguro quanto possível.

source: Manage<br />on the Go
pt_br: Gerencie<br />de qualquer lugar

source: May 27, 2018 is the 15th anniversary of the first WordPress release ﻿— and we can’t wait to celebrate!
pt_br: Dia 27 de maio é o 15º aniversário do lançamento da primeira versão do WordPress ﻿e nós estamos ansiosos para celebrar!

source: Media Management
pt_br: Gerenciamento de mídia

source: MediaElement has released a new version that contains a fix for the bug, and a WordPress plugin containing the fixed files is available in the plugin repository.
pt_br: Foi lançada uma nova versão da biblioteca MediaElement que corrige o erro e um plugin WordPress contendo os arquivos corrigidos está disponível no repositório.

source: Meet WordPress
pt_br: Conheça o WordPress

source: Menus now properly support keyboard and touch interactions.
pt_br: Menus agora têm suporte apropriado a interações por toque e teclado.

source: Meta boxes are
pt_br: Meta boxes are (Meta boxes são)

source: Meta boxes had a few bugs, and they weren’t showing at all in the block editor, so we’ve fixed and polished there.
pt_br: Existiam alguns problemas com as meta boxes e elas não estavam aparecendo no editor de blocos, mas isso já foi corrigido.

source: Minor bug fixes
pt_br: Corrigindo erros pequenos

source: Miscellaneous improvements include:
pt_br: Outras melhorias incluem:

source: Miss my haiku?
pt_br: Sentiu falta dos haikai?

source: More consistent keyboard navigation between blocks, as well as back-and-forth between different areas of the interface.
pt_br: Melhoria na consistência da navegação entre blocos feita pelo teclado, assim como ajustes nas diferentes áreas da interface.

source: Most significantly, WordPress 5.1 includes solid performance improvements within the editor.
pt_br: Mais significativamente, o WordPress 5.1 inclui sólidas melhorias no desempenho do editor.

source: Move editor specific styles from style.scss to editor.scss in Cover block.
pt_br: Estilos específicos para o editor no bloco de Capa foram movidos do style.scss para o editor.scss.

source: Multilingual
pt_br: Multi-idioma

source: Multisite Metadata
pt_br: Metadados de multisite

source: Musician
pt_br: Músico

source: MySQL Version
pt_br: Versão do MySQL

source: Navigation submenus have been implemented for mobile devices.
pt_br: Submenus de navegação foram implementados para dispositivos móveis.

source: Nearly party time! 🎉
pt_br: Vamos comemorar! 🎉

source: New JS Build Processes
pt_br: Novos processos de build de JS

source: New WordPress installs not setting the database table prefix correctly (#46220).
pt_br: Configuração incorreta do prefixo das tabelas do banco de dados em novas instalações do WordPress (#46220).

source: New section on privacy will be added to the Plugin Handbook.
pt_br: Nova seção sobre privacidade será incluída no manual dos plugins.

source: New test config file constant in the test suite, new plugin action hooks
pt_br: Nova constante de teste no arquivo de configuração da suíte de testes, novos hooks para ações com plugins

source: News From Our Blog
pt_br: Novidades de nosso blog

source: News and Updates
pt_br: Novidades e atualizações

source: Next
pt_br: Seguinte

source: Next post:
pt_br: Próximo post:

source: Nginx or Apache with mod_rewrite module
pt_br: Nginx ou Apache com o módulo mod_rewrite

source: Nice work!
pt_br: Bom trabalho!

source: No musician chosen.
pt_br: Nenhum músico escolhido.

source: Not required, but recommended for better security
pt_br: Não obrigatório, mas recomendado por questão de segurança

source: Nothing Found
pt_br: Nada encontrado

source: Occupation
pt_br: Ocupação

source: Of course, we couldn’t release a beautiful new default theme, and leave all of our old ones behind.
pt_br: Claro, nós não poderíamos lancar uma nova e linda versão de um tema padrão e deixar todos os novos temas antigos para trás.

source: Of course, we recognise you might not be ready for this change quite yet.
pt_br: Claro, sabemos que você pode não estar preparado para essa mudança ainda.

source: Official WordPress Logo
pt_br: Logo oficial do WordPress

source: Old is new again.
pt_br: Old is new again. (o velho é o novo de novo.)

source: Older versions of PHP do not have this, so updating is essential to keep your WordPress site secure.
pt_br: Versões mais antigas do PHP não as contém, por isso é essencial atualizá-lo para manter seu site WordPress seguro.

source: One of the features originally slated for WordPress 5.1—the PHP error protection handler—will target WordPress 5.2 instead.
pt_br: A proteção contra erros de PHP, um dos recursos originalmente planejados para o WordPress 5.1, será adiado para o WordPress 5.2.

source: One thought on &ldquo;%1$s&rdquo;
pt_br: Um comentário em &ldquo;%1$s&rdquo;

source: One-third of the web!
pt_br: Um terço da internet!

source: Or download the beta here (zip).
pt_br: Ou baixando a versão beta aqui (zip).

source: Or you can download the beta here (zip).
pt_br: Ou faça o download da versão beta aqui (arquivo zip).

source: Other Developer Goodness
pt_br: Outras novidades para os desenvolvedores

source: Other changes in behavior affect cron spawning on servers running FastCGI and PHP-FPM versions 7.0.16 and above.
pt_br: Outras mudanças no comportamento afetam a execução do cron em servidores usando FastCGI e PHP-FPM versões 7.0.16 ou posteriores.

source: Other highlights of this release include:
pt_br: Outros destaques desta versão incluem:

source: Our Bill of Rights
pt_br: Nossa Declaração de Direitos

source: Our Mission
pt_br: Nossa missão

source: Our Story
pt_br: Nossa história

source: Our latest release has already been downloaded close to 14 million times, and it was only released on the 21st of February.
pt_br: Nossa última versão já foi baixada quase 14 milhões de vezese ela foi lançada só em 21 de fevereiro.

source: Our market share has been growing steadily over the last few years, going from 29.9% just one year ago to 33.4% now.
pt_br: Nossa participação no mercado tem crescido consistentemente nos últimos anos, aumentando de 29,9% apenas há um ano para 33,4% atualmente.

source: Out of the Box
pt_br: Pronto para usar

source: Over 60 million people have chosen WordPress to power the place on the web they call &ldquo;home&rdquo; &mdash; join the family.
pt_br: Mais de 60 milhões de pessoas escolheram o WordPress para construir seus sites e blogs. Junte-se à família.

source: Over 110 tickets have been closed since beta 1, many of which are documentation and testing suite improvements.
pt_br: Mais de 110 tickets foram fechados desde a versão beta 1 e muitos deles são melhorias na documentação e no conjunto de testes.

source: Over the years WordPress has become the CMS of choice for more and more people and companies.
pt_br: Com o passar dos anos, o WordPress se tornou a escolha para Sistema de gerenciamento de conteúdo (CMS, Content Management System) de cada vez mais pessoas e empresas.

source: Own Your Data
pt_br: Seja dono dos seus dados

source: PDF <span>(Vector)</span>
pt_br: PDF <span>(vetor)</span>

source: PHP %s or greater
pt_br: PHP %s ou superior

source: PHP 7.3 Support
pt_br: Suporte para PHP 7.3

source: PHP 7.3 compatibility has been improved.
pt_br: A compatibilidade com o PHP 7.3 foi melhorada.

source: PHP Version Bump
pt_br: Versão do PHP

source: PHP Versions
pt_br: Versões do PHP

source: PHP is the coding language WordPress is built on, and its version is set at the server-level by your hosting company.
pt_br: O PHP é a linguagem de código usada pelo WordPress e a sua versão é configurada a nível de servidor pela sua empresa de hospedagem.

source: PNG <span>(White/transparent)</span>
pt_br: PNG <span>(branco/transparente)</span>

source: Page
pt_br: Página

source: Page index cannot be less than one.
pt_br: Índice da página não pode ser menor que um.

source: Pages:
pt_br: Páginas:

source: Pagination for Privacy request admin screens can now be adjusted.
pt_br: A paginação das telas de aministração das solicitações de privacidade agora pode ser ajustada.

source: Particularly of note were:
pt_br: Os mais importantes foram:

source: Party time!
pt_br: É hora da festa!

source: Password
pt_br: Senha

source: Password Lost and Found
pt_br: Achados e perdidos de senhas

source: Pending Review: %s
pt_br: Avaliação pendente: %s

source: Permissions and current user API
pt_br: Permissões e API de usuário atual

source: Philosophy
pt_br: Filosofia

source: Planned
pt_br: Planejado

source: Please check your email %s for a confirmation link to set your password.
pt_br: Confira o e-mail %s para acessar o endereço de confirmação e configure sua senha.

source: Please enable JavaScript to view this page properly.
pt_br: Ative o JavaScript para ver esta página de forma apropriada.

source: Please test your plugins and themes against WordPress 5.0 and update the Tested up to version in the readme to 5.0.
pt_br: Teste seus plugins e temas com o WordPress 5.0 e atualize para 5.0 a versão no campo Tested up to do arquivo readme.

source: Please test your plugins and themes against WordPress 5.1 and update the Tested up to version in the readme to 5.1.
pt_br: Teste seus plugins e temas com o WordPress 5.1 e atualize para 5.1 a versão no campo Tested up to do arquivo readme.

source: Please try again.
pt_br: Tente novamente.

source: Plugin System
pt_br: Sistema de plugins

source: Plugin and Theme Developers
pt_br: Desenvolvedores de plugins e temas

source: Plugin authors are encouraged to read the 5.0.1 developer notes for information on backwards-compatibility.
pt_br: Recomendamos que autores de plugins leiam as notas de desenvolvedor do 5.0.1 para informações sobre retrocompatibilidade.

source: Plugins can now specify the minimum version of PHP that they support, so you can safely modernise your development practices without risking breaking your users’ sites.
pt_br: Plugins agora podem espeficiar a versão mínima de PHP suportada, para que seja possível usar práticas mais modernas de desenvolvimento sem o risco de quebrar os sites dos usuários.

source: Posted on
pt_br: Publicado em

source: Posted on %1$s by %2$s.
pt_br: Publicado em %1$s por %2$s.

source: Posts by Sarah Gooding
pt_br: Post por Sarah Gooding

source: Posts, Post Types: Clear post password cookie when logging out.
pt_br: Posts e tipos de posts: Limpa o cookie de senha de post ao sair.

source: Powerful Features
pt_br: Recursos poderosos

source: Powerful<br />Media Management
pt_br: Gerenciamento de mídias<br />poderoso

source: Previous
pt_br: Anterior

source: Previous post:
pt_br: Post anterior:

source: Previously, the plugin allowed users to display a grid of products by category.
pt_br: Anteriormente, o plugin permitia aos usuários exibir uma grade de produtos por categoria.

source: Primary
pt_br: Primário

source: Primary Menu
pt_br: Menu primário

source: Privacy
pt_br: Privacidade

source: Privacy Policy
pt_br: Política de privacidade

source: Privacy Policy Changes
pt_br: Alterações na política de privacidade

source: Privacy fixes/enhancements
pt_br: Ajustes e melhorias de privacidade

source: Privacy: Make sure default privacy policy content does not cause a fatal error when flushing rewrite rules outside of the admin context.
pt_br: Privacidade: Verifica se o conteúdo padrão da política de privacidade não causa um erro fatal ao limpar as regras de reescrita fora do contexto de administração.

source: Profile of %1$s (%2$s)
pt_br: Perfil de %1$s (%2$s)

source: Props to Simon Scannell of RIPS Technologies who discovered this flaw independent of some work that was being done by members of the core security team.
pt_br: Nossos agradecimentos a Simon Scannell da RIPS Technologies, que descobriu esta vulnerabilidade independentemente do esforço que já estava sendo feito pelos membros da equipe de segurança dos arquivos básicos.

source: Publish with Ease
pt_br: Publique com facilidade

source: Publishing Tools
pt_br: Ferramentas para publicação

source: Pull up some Betty Carter on your music service of choice, and check out some of their profiles:
pt_br: Deixe rolar um pouco da Betty Carter no seu serviço de música favorito e dê uma olhada em alguns dos perfis:

source: Recommended web hosting providers
pt_br: Serviços de hospedagens recomendados

source: Regards, All at ###SITENAME### ###SITEURL###
pt_br: Atenciosamente, Equipe do site ###SITENAME### ###SITEURL###

source: Remove the ability to upload JavaScript files for users who do not have the unfiltered_html capability.
pt_br: Remoção da habilidade de subir arquivos JavaScript para usuários que não tenham a capacidade unfiltered_html.

source: Requirements
pt_br: Requisitos

source: Resources
pt_br: Recursos

source: Resources for WordPress developers
pt_br: Recursos para desenvolvedores WordPress

source: Responsive<br />Mobile Sites
pt_br: Sites<br />responsivos

source: Reviewing and publishing the policy.
pt_br: Revisando e publicando a política.

source: Roadmap
pt_br: Plano de ação

source: Rosetta Sites & Forums
pt_br: Sites Rosetta e fóruns

source: Run through these steps, and you’ll be ready to update the PHP version on your WordPress site – and enjoy all of the benefits that come with this!
pt_br: Execute estes passos e tudo estará pronto para atualizar a versão PHP do seu site WordPress. Aproveite todos os benefícios que isso trará!

source: SEO<br />Friendly
pt_br: Pronto para<br />SEO

source: SSRF (Server Side Request Forgery) Attacks
pt_br: Ataques por Falsificação de requisições feitas pelo lado do servidor (SSRF, Server Side Request Forgery)

source: Save Profile Information
pt_br: Salvar informações do perfil

source: Screenshot of the new block editor interface.
pt_br: Captura de tela da interface do novo editor de blocos.

source: Script concatenation is now supported.
pt_br: Suporte a concatenação de scripts.

source: Search
pt_br: Pesquisar

source: Search &hellip;
pt_br: Pesquisar &hellip;

source: Search Engine Optimized
pt_br: Otimizado para mecanismos de pesquisa

source: Search Results for: %s
pt_br: Resultados de pesquisa para: %s

source: Security
pt_br: Segurança

source: Select the language:
pt_br: Selecione o idioma:

source: Set your password and complete your WordPress.org Profile information.
pt_br: Determine sua senha e complete as informações do seu perfil no WordPress.org.

source: Seventeen other bugs were fixed in WordPress 4.9.7.
pt_br: Outros dezessete erros foram resolvidos no WordPress 4.9.7.

source: Several minor bug fixes.
pt_br: Correção de vários pequenos erros.

source: Share the fun
pt_br: Compartilhe a diversão

source: Share your WordPress story
pt_br: Compartilhe a sua história com o WordPress

source: Share your ideas for improving WordPress
pt_br: Compartilhe suas ideias para melhorar o WordPress

source: Short-circuit filters for wp_unique_post_slug(), WP_User_Query, and count_users()
pt_br: Filtros de curto-circuito para wp_unique_post_slug(), WP_User_Query e count_users()

source: Show welcome box
pt_br: Mostrar caixa de boas-vindas

source: Significant changes
pt_br: Mudanças significativas

source: Simon Scannell of RIPS Technologies discovered that authors could create posts of unauthorized post types with specially crafted input.
pt_br: Simon Scannell da RIPS Technologies descobriu que autores poderiam criar posts de tipos diferentes sem autorização transmitindo dados de uma certa forma.

source: Simplicity
pt_br: Simplicidade

source: Since then, we’ve made 70 changes in Beta 2.
pt_br: Desde então, nós fizemos 70 mudanças no Beta 2.

source: Site Health
pt_br: Diagnóstico do site

source: Site Health Check
pt_br: Diagnóstico do site

source: Site Health Check is an ongoing project aimed at improving the stability and performance of the entire WordPress ecosystem.
pt_br: Diagnóstico do site é um projeto em andamento que tem como objetivo melhorar a estabilidade e o desempenho de todo o ecossistema do WordPress.

source: Site owners will be able to create GDPR compliant privacy policy in three steps:
pt_br: Proprietários de sites poderão criar uma política de privacidade compatível com o GDPR em três etapas:

source: Sites that support automatic background updates are already beginning to update automatically.
pt_br: Sites com suporte a atualizações automáticas em segundo plano já começaram a se atualizar.

source: Sites that support automatic background updates have already started to update automatically.
pt_br: Sites com suporte a atualizações automáticas em segundo plano já começaram a se atualizar.

source: Six years later, in January 2011, WordPress was powering 13.1% of websites.
pt_br: Seis anos depois, em janeiro de 2011, o WordPress era responsável por 13,1% dos sites.

source: Skip to content
pt_br: Pular para o conteúdo

source: So in addition to listing where data goes, you should describe how you ensure that these standards are met either by yourself or by your third party providers, whether that is through an agreement such as Privacy Shield, model clauses in your contracts, or binding corporate rules.
pt_br: Assim, além de listar para onde os dados vão, é preciso descrever como você garante que estes padrões estejam sendo seguidos, opr você ou pelos seus provedores terceiros, seja por meio de um acordo como o Escudo de Privacidade, cláusulas modelo nos seus contratos ou normas corporativas vinculatórias.

source: So show the love and spread the word &mdash; get your <a href="%s">WordPress swag</a> today.
pt_br: Então mostre o seu amor e espalhe a palavra! Obtenha o seu <a href="%s">produto WordPress</a> hoje mesmo.

source: So, we fixed them all.
pt_br: Então corrigimos todos.

source: Some internationalization (i18n) issues related to script loading have also been fixed.
pt_br: Alguns problemas na internacionalização (i18n) relacionados ao carregamento de scripts também foram corrigidos.

source: Some issues uploading common file types, like CSVs, have been fixed.
pt_br: Alguns problemas ao enviar arquivos com tipos comuns como CSVs, foram corrigidos.

source: Some of the best WordPress sites on the Web
pt_br: Alguns dos melhores sites em WordPress na internet

source: Some potential security issues were discovered in the implementation: rather than risk releasing insecure code, the team decided to pull it out of WordPress 5.1.
pt_br: Como alguns problemas de segurança em potencial foram descobertos na implementação, ao invés de arriscar o lançamento de um código inseguro, a equipe decidiu retirá-lo do WordPress 5.1.

source: Some that we’ve found, too.
pt_br: E alguns que encontramos também.

source: Speaker Training [and Diversity Speaker Outreach]
pt_br: Treinamento de palestrantes [e promoção da diversidade de palestrantes]

source: Special Swag
pt_br: Produtos especiais

source: Standard
pt_br: Padrão

source: Starting at just over 10% in January 2011 to 33.4% now.
pt_br: Começando com pouco mais de 10% em janeiro de 2011 para 33,4% agora.

source: Statistics
pt_br: Estatísticas

source: Strength indicator
pt_br: Indicador de força

source: Striving for Simplicity
pt_br: Lutando pela simplicidade

source: Submit for review
pt_br: Enviar para avaliação

source: Subscribe to WordPress Announcements mailing list (a few messages a year)
pt_br: Assinar a lista de e-mail dos anúncios do WordPress (poucas mensagens por ano)

source: Subscribe to the Make WordPress Core blog for updates over the coming weeks, detailing other changes in 5.1 that you should be aware of.
pt_br: Assine o blog Make WordPress Core para receber atualizações nas próximas semanas, detalhando outras mudanças importantes da versão 5.1.

source: Subscribe to this blog
pt_br: Assine este blog

source: Support
pt_br: Suporte

source: Swag
pt_br: Produtos

source: Switching themes will now attempt to restore previous widget assignments, even when there are no sidebars to map.
pt_br: Alternar entre temas tentará agora restaurar a atribuição anterior dos widgets, mesmo quando não há áreas de widgets a serem mapeadas.

source: Taxonomy: Improve cache handling for term queries.
pt_br: Taxonomia: Melhora na manipulação do cache para consultas por termos.

source: Terms
pt_br: Termos

source: Testimonials
pt_br: Depoimentos

source: Thank you for helping! 💖
pt_br: Agradecemos a sua ajuda! 💖

source: Thank you to Slavco for reporting the original issue and Matt Barry for reporting related issues.
pt_br: Agradecemos a Slavco por informar o problema original e a Matt Barry por relatar problemas relacionados.

source: Thank you to all of the reporters for privately disclosing the vulnerabilities, which gave us time to fix them before WordPress sites could be attacked.
pt_br: Agradecemos a todos por terem relatado as vulnerabilidades de forma privada, nos dando tempo para corrigi-as antes que os sites WordPress fossem atacados.

source: Thank you to everyone who contributed to WordPress 4.9.1:
pt_br: Agradecemos a todos que contribuíram para o WordPress 4.9.1:

source: Thank you to everyone who contributed to WordPress 4.9.2:
pt_br: Agradecemos a todos que contribuíram para o WordPress 4.9.2:

source: Thank you to everyone who contributed to WordPress 4.9.5:
pt_br: Agradecemos a todos que contribuíram para o WordPress 4.9.5:

source: Thank you to everyone who contributed to WordPress 4.9.7:
pt_br: Agradecemos a todos que contribuíram para o WordPress 4.9.7:

source: Thank you to everyone who contributed to WordPress 4.9.8:
pt_br: Agradecemos a todos que contribuíram para o WordPress 4.9.8:

source: Thank you to everyone who contributed to WordPress 5.0.2:
pt_br: Agradecemos a todos que contribuíram para o WordPress 5.0.2:

source: Thank you to everyone who contributed to WordPress 5.0.3:
pt_br: Agradecemos a todos que contribuíram para o WordPress 5.0.3:

source: Thank you to the reporters of these issues for practicing responsible security disclosure: Rahul Pratap Singh and John Blackbourn.
pt_br: Agradecemos a todos os que identificaram e relataram esses problemas pelo modo responsável como isso foi feito: Rahul Pratap Singh e John Blackbourn.

source: Thank you to the reporters of these issues for practicing ﻿coordinated security disclosure: xknown of the WordPress Security Team, Nitin Venkatesh (nitstorm), and Garth Mortensen of the WordPress Security Team.
pt_br: Agradecemos a todos os que identificaram e relataram esses problemas pelo modo responsável como isso foi feito: xknown e Garth Mortensen da Equipe de segurança do WordPress e Nitin Venkatesh (nitstorm)

source: Thank you to the reporters of this issue for practicing responsible security disclosure: Enguerran Gillier and Widiz﻿.
pt_br: Nossos agradecimentos para quem informou esses problemas pelo modo responsável como isso foi feito: Enguerran Gillier e Widiz﻿.

source: Thanks for choosing WordPress!
pt_br: Agradecemos por escolher o WordPress!

source: Thanks for making the internet a better place!
pt_br: Agradecemos por fazer a internet um lugar melhor!

source: Thanks!
pt_br: Obrigado!
